Revit 2026 API

# ConnectionInputPointPoint Property

---

3d position of this input point.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Point { get; set; }
```
```vb
Public Property Point As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ Point {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member Point : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

ConnectionInputPoint Class

Autodesk.Revit.DB.Structure Namespace